{
    "chapters": {
      "2": {
        "verses": {
          "2": {
            "original_verse": "The Blessed One said: How does this faint heart come to you in time of difficulty? This is not suitable for a noble one; it is not heavenly, and brings on disgrace.",
            "speaker": "Krishna",
            "commentary": {
              "shankaracharya": "Krishna critiques Arjuna's despondency, emphasizing the importance of courage and action as befitting a warrior and a noble soul."
            },
            "tags": ["duty", "courage"]
          },
          "3": {
            "original_verse": "Do not become a cowardly eunuch, Son of Pritha; this is not fitting for you. Let go of this lowly weakness of the heart and stand up, Scorcher of the Enemy!",
            "speaker": "Krishna",
            "commentary": {
              "shankaracharya": "Krishna urges Arjuna to cast off his weakness, invoking his responsibility and valor as a Kshatriya (warrior)."
            },
            "tags": ["valor", "weakness", "responsibility"]
          },

        "11": {
          "original_verse": "The Blessed One said: You have grieved for those who should not be grieved for, yet you speak words of wisdom. The wise do not grieve for the living or the dead.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna introduces the core teaching of detachment by emphasizing that grief arises from ignorance of the eternal nature of the self."
          },
          "tags": ["grief", "wisdom", "detachment"]
        },
        "12": {
          "original_verse": "Never was there a time when I did not exist, nor you, nor these kings; and never will there be a time when we shall cease to exist.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna highlights the immortality of the soul, teaching that existence transcends birth and death."
          },
          "tags": ["eternity", "soul", "existence"]
        },
        "13": {
          "original_verse": "Just as the embodied self passes through childhood, youth, and old age, so also it passes into another body. The wise are not deluded by this.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna explains the transmigration of the soul, likening the changes of the body to the stages of life, to encourage detachment."
          },
          "tags": ["soul", "transmigration", "wisdom"]
        },
        "14": {
          "original_verse": "Contact of the senses with their objects produces cold and heat, pleasure and pain. They come and go and are impermanent. Endure them, O Bharata.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna advises equanimity in the face of sensory experiences, stressing their temporary nature."
          },
          "tags": ["senses", "impermanence", "equanimity"]
        },
        "15": {
          "original_verse": "The person whom these do not disturb, O Chief among men, and who remains the same in pleasure and pain, is wise and fit for immortality.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna describes the state of equanimity as essential for spiritual liberation and the realization of immortality."
          },
          "tags": ["equanimity", "wisdom", "immortality"]
        },
        "16": {
          "original_verse": "The unreal has no existence; the real never ceases to be. The seers of truth have concluded the nature of both.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna introduces the distinction between the eternal reality of the soul and the transience of the material world."
          },
          "tags": ["reality", "truth", "soul"]
        },
        "17": {
          "original_verse": "Know that to be indestructible by which all this is pervaded. None can destroy the imperishable self.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "The soul is described as eternal and indestructible, reinforcing the idea of its transcendence over physical destruction."
          },
          "tags": ["soul", "indestructibility", "eternal"]
        },
        "18": {
          "original_verse": "These bodies of the eternal, imperishable, and incomprehensible embodied self are said to have an end. Therefore, fight, O Bharata.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna contrasts the temporary nature of the body with the eternal self, encouraging Arjuna to perform his duty."
          },
          "tags": ["body", "self", "duty"]
        },
        "19": {
          "original_verse": "He who thinks that the self kills, and he who thinks that it is killed, are both ignorant. The self kills not, nor is it killed.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna emphasizes that the self is beyond action and unaffected by physical processes like killing or being killed."
          },
          "tags": ["ignorance", "soul", "nonviolence"]
        },
        "20": {
          "original_verse": "The self is never born, nor does it die. It does not come into existence, nor cease to be. It is unborn, eternal, changeless, and ancient; it is not killed when the body is killed.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna affirms the timeless nature of the self, untouched by the cycle of birth and death."
          },
          "tags": ["soul", "eternity", "immortality"]
        },
        "21": {
          "original_verse": "He who knows that the self is indestructible, eternal, unborn, and immutable—how can that person kill or cause to kill, O Partha?",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna questions the logic of Arjuna’s grief, pointing out that the eternal self cannot be harmed."
          },
          "tags": ["logic", "eternity", "self"]
        },
        "22": {
          "original_verse": "Just as a person casts off worn-out garments and puts on new ones, so the embodied self casts off worn-out bodies and enters others that are new.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna uses the metaphor of changing garments to illustrate the process of reincarnation."
          },
          "tags": ["reincarnation", "soul", "metaphor"]
        },
        "23": {
          "original_verse": "Weapons do not cut it, fire does not burn it, water does not wet it, wind does not dry it.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "The self is described as invulnerable to physical forces, highlighting its transcendental nature."
          },
          "tags": ["invulnerability", "soul", "transcendence"]
        },
        "24": {
          "original_verse": "It cannot be cut, burned, wetted, or dried. It is eternal, all-pervading, stable, immovable, and timeless.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna emphasizes the unchanging, eternal nature of the self, which pervades all existence."
          },
          "tags": ["eternity", "self", "stability"]
        },
        "25": {
          "original_verse": "It is said to be unmanifest, unthinkable, and unchanging. Therefore, knowing it to be such, you should not grieve.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "The self is beyond perception and thought; understanding this truth liberates one from grief."
          },
          "tags": ["self", "grief", "truth"]
        },
        "26": {
          "original_verse": "But if you think of it as being perpetually born and perpetually dying, even then, O Mighty-armed, you should not grieve.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Even within the framework of mortality, grief is unwarranted as life is a cycle of continuity."
          },
          "tags": ["mortality", "grief", "continuity"]
        },
        "27": {
          "original_verse": "For certain is death for the born, and certain is birth for the dead. Therefore, you should not grieve over the inevitable.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna points out the inevitability of the life-death cycle, urging detachment and acceptance."
          },
          "tags": ["inevitability", "detachment", "acceptance"]
        },
        "28": {
          "original_verse": "Beings are unmanifest in their beginning, manifest in their middle state, and unmanifest again in their end, O Bharata. What is there to grieve over?",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna explains that existence is cyclical, with appearances being transient phases, and hence grieving over such impermanent states is unnecessary."
          },
          "tags": ["cyclic existence", "transience", "grief"]
        },
        "29": {
          "original_verse": "Some look upon the self as a marvel, some speak of it as a marvel, some hear of it as a marvel, and yet others, even after hearing, do not understand it at all.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "The self is described as an enigmatic and profound truth, appreciated fully only by a few, while most fail to grasp its essence."
          },
          "tags": ["self", "marvel", "understanding"]
        },
        "30": {
          "original_verse": "The self that dwells in all bodies can never be slain, O Bharata. Therefore, you should not grieve for any being.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna reiterates the indestructibility of the self, urging Arjuna to abandon sorrow and act according to his duty."
          },
          "tags": ["self", "indestructibility", "grief"]
        },
        "31": {
          "original_verse": "Further, looking at your own dharma, you should not waver, for there is nothing higher for a Kshatriya than a righteous war.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna reminds Arjuna of his duty as a warrior, emphasizing that fighting in a righteous war aligns with his dharma."
          },
          "tags": ["dharma", "duty", "war"]
        },
        "32": {
          "original_verse": "Fortunate are the Kshatriyas who are called to fight in such a battle, which comes unsought as an open door to heaven.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna presents the battle as an opportunity for glory and spiritual elevation, emphasizing its rare and noble nature."
          },
          "tags": ["duty", "opportunity", "glory"]
        },
        "33": {
          "original_verse": "But if you will not fight this righteous battle, then, having abandoned your dharma and honor, you will incur sin.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna warns Arjuna of the spiritual and moral consequences of abandoning his duty, framing inaction as sinful."
          },
          "tags": ["dharma", "sin", "consequences"]
        },
        "34": {
          "original_verse": "People will recount your everlasting dishonor, and for a man of honor, dishonor is worse than death.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna appeals to Arjuna’s sense of honor, emphasizing the disgrace and shame that inaction would bring."
          },
          "tags": ["honor", "disgrace", "duty"]
        },
        "35": {
          "original_verse": "The great warriors will think that you have withdrawn from the battle out of fear, and those who once held you in high esteem will speak of you with contempt.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna underscores the perception of cowardice and the loss of respect that would follow Arjuna’s retreat."
          },
          "tags": ["perception", "cowardice", "respect"]
        },
        "36": {
          "original_verse": "Your enemies will slander you in unseemly words and deride your strength. What could be more painful than that?",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna appeals to Arjuna’s warrior pride, warning him of the humiliation and mockery he would face from his enemies."
          },
          "tags": ["humiliation", "pride", "enemies"]
        },
        "37": {
          "original_verse": "If you are killed, you will attain heaven; if you are victorious, you will enjoy the earth. Therefore, arise, O son of Kunti, resolved to fight!",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna motivates Arjuna by framing both outcomes—death or victory—as beneficial and urging him to act with resolve."
          },
          "tags": ["resolve", "motivation", "action"]
        },
        "38": {
          "original_verse": "Treating alike pleasure and pain, gain and loss, victory and defeat, then prepare for battle. Thus you will not incur sin.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna introduces the concept of equanimity, emphasizing that detachment from outcomes ensures freedom from sin."
          },
          "tags": ["equanimity", "detachment", "sin"]
        },
        "39": {
          "original_verse": "This wisdom has been taught to you from the perspective of Sankhya. Now listen to it from the perspective of yoga, which frees one from the bondage of action.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna transitions to explaining karma yoga, highlighting its role in transcending the limitations of action and attachment."
          },
          "tags": ["wisdom", "yoga", "karma"]
        },
        "40": {
          "original_verse": "In this path, no effort is ever wasted, and no failure arises. Even a little of this practice protects one from great fear.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna emphasizes the infallibility of the yoga path, assuring Arjuna of its lasting benefits and protective nature."
          },
          "tags": ["yoga", "effort", "fearlessness"]
        },
        "41": {
          "original_verse": "In this, O Joy of the Kurus, there is a single, unwavering conviction. The thoughts of the irresolute are many-branched and endless.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna emphasizes the importance of a resolute and focused mind in the path of knowledge and action, contrasting it with the scattered nature of the irresolute."
          },
          "tags": ["focus", "resolution", "irresolution"]
        },
        "42": {
          "original_verse": "O Partha, the unwise, enchanted by the flowery words of the Vedas, and attached to desires, consider heaven as the supreme goal.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna criticizes those who are preoccupied with material rewards and superficial interpretations of the Vedas, neglecting deeper spiritual truths."
          },
          "tags": ["materialism", "desires", "spiritual ignorance"]
        },
        "43": {
          "original_verse": "They are full of desire and intent on heaven; they utter speech that leads to actions that yield rebirth as the fruit of their works and are full of specific rituals.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Such individuals are bound by rituals and desire-driven actions, which perpetuate the cycle of birth and death, preventing liberation."
          },
          "tags": ["desires", "rituals", "rebirth"]
        },
        "44": {
          "original_verse": "The resolute wisdom of those who are too attached to enjoyment and power is not established in the Self, O Arjuna.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Attachment to power and pleasure obstructs the realization of the Self, leading to spiritual stagnation."
          },
          "tags": ["attachment", "power", "wisdom"]
        },
        "45": {
          "original_verse": "The Vedas deal with the three qualities of nature. Be free from these qualities, O Arjuna, and free from duality, ever firm in purity, independent of possessions, and possessed of the Self.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna urges Arjuna to transcend the gunas (qualities) and dualities of nature, focusing instead on inner purity and self-realization."
          },
          "tags": ["gunas", "duality", "self-realization"]
        },
        "46": {
          "original_verse": "To the knower of the Self, the Vedas are as useful as a small reservoir of water in a flood.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna conveys that for one established in self-knowledge, the rituals and instructions of the Vedas lose their significance, akin to a small reservoir being redundant during a flood."
          },
          "tags": ["self-knowledge", "rituals", "realization"]
        },
        "47": {
          "original_verse": "Your right is to perform action alone, never to its fruits. Let not the fruits of action be your motive, nor let your attachment be to inaction.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna introduces the concept of Nishkama Karma (selfless action), advising Arjuna to focus on duty without attachment to outcomes."
          },
          "tags": ["selfless action", "duty", "detachment"]
        },
        "48": {
          "original_verse": "Remaining steadfast in yoga, O Arjuna, perform actions, abandoning attachment and remaining even-minded in success and failure. This equanimity is called yoga.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna defines yoga as equanimity in all circumstances, achieved through detachment and focused action."
          },
          "tags": ["yoga", "equanimity", "detachment"]
        },
        "49": {
          "original_verse": "Action is far inferior to the yoga of wisdom, O Arjuna. Take refuge in wisdom. Those who are motivated by fruits are miserable.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna extols the superiority of wisdom over mere ritualistic actions, urging Arjuna to embrace higher knowledge."
          },
          "tags": ["wisdom", "action", "detachment"]
        },
        "50": {
          "original_verse": "One who is steadfast in wisdom casts off both good and evil deeds here. Therefore, strive for yoga. Yoga is skill in action.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna describes yoga as skillful and detached action that transcends the duality of good and bad karma."
          },
          "tags": ["karma", "yoga", "skill"]
        },
        "51": {
          "original_verse": "The wise, steadfast in yoga, renounce the fruits of action. Freed from the bonds of birth, they reach a state beyond suffering.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna highlights the liberation achieved through yoga, which frees one from rebirth and leads to ultimate bliss."
          },
          "tags": ["liberation", "yoga", "freedom"]
        },
        "52": {
          "original_verse": "When your intellect crosses beyond the mire of delusion, you shall become indifferent to what has been heard and what is yet to be heard.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna explains that liberation from delusion leads to freedom from dependence on external teachings and rituals, as self-knowledge becomes paramount."
          },
          "tags": ["intellect", "delusion", "freedom"]
        },
        "53": {
          "original_verse": "When your intellect, bewildered by the Vedas, becomes unmoving and steady in contemplation, then you shall attain yoga.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna points out that unwavering focus and contemplation lead to the realization of yoga, transcending confusion caused by ritualistic interpretations."
          },
          "tags": ["contemplation", "yoga", "focus"]
        },
       
        "55": {
          "original_verse": "The Blessed One said: When a man gives up all desires of the mind, O Partha, and is satisfied in the Self alone, then he is said to be steady in wisdom.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna defines the wise as those who have renounced desires and found contentment within the Self, embodying inner fulfillment."
          },
          "tags": ["wisdom", "self-contentment", "desirelessness"]
        },
        "56": {
          "original_verse": "He whose mind is not shaken by adversity, who does not hanker after pleasures, and who is free from attachment, fear, and anger, is called a sage of steady wisdom.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna highlights equanimity and freedom from negative emotions as key attributes of the steadfast sage."
          },
          "tags": ["steadiness", "equanimity", "wisdom"]
        },
        "57": {
          "original_verse": "He who is everywhere without attachment, on meeting with anything good or bad, who neither rejoices nor recoils, his wisdom is established.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna describes the sage as someone unaffected by external circumstances, maintaining detachment and inner balance."
          },
          "tags": ["detachment", "balance", "wisdom"]
        },
        "58": {
          "original_verse": "When, like a tortoise drawing in its limbs, he withdraws his senses from the objects of sense, then his wisdom is established.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna uses the tortoise metaphor to illustrate the wise person's ability to withdraw from sensory distractions."
          },
          "tags": ["sense-control", "wisdom", "detachment"]
        },
        "59": {
          "original_verse": "The objects of sense turn away from the abstinent man, leaving the longing behind; but his longing also turns away upon seeing the Supreme.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna explains that desire subsides only when one experiences the higher joy of realizing the Supreme."
          },
          "tags": ["desire", "abstinence", "realization"]
        },
        "60": {
          "original_verse": "The turbulent senses, O son of Kunti, violently carry away the mind of even a wise man striving for perfection.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna warns about the power of the senses and the need for constant vigilance, even for those on the path of wisdom."
          },
          "tags": ["senses", "vigilance", "mind-control"]
        },
        "61": {
          "original_verse": "Restraining them all, he should remain steadfast, intent on Me. His wisdom is steady whose senses are under control.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna emphasizes the importance of sense control and devotion to achieve steadiness of wisdom."
          },
          "tags": ["sense-control", "devotion", "wisdom"]
        },
        "62": {
          "original_verse": "When a man dwells on the objects of sense, attachment to them arises; from attachment desire is born, and from desire anger is born.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna outlines the chain reaction of attachment leading to desire, anger, and ultimately downfall."
          },
          "tags": ["attachment", "desire", "anger"]
        },
        "63": {
          "original_verse": "From anger comes delusion; from delusion, loss of memory; from loss of memory, destruction of intellect; and from the destruction of intellect, he perishes.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna warns against anger, detailing how it leads to delusion and the eventual collapse of one's reasoning and progress."
          },
          "tags": ["anger", "delusion", "intellect"]
        },
        "64": {
          "original_verse": "But the self-controlled man, moving among objects with senses under restraint and free from attachment and aversion, attains peace.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna describes the state of peace attained through self-control and detachment from sensory pleasures."
          },
          "tags": ["self-control", "detachment", "peace"]
        },
        "65": {
          "original_verse": "In that peace, all sorrow is destroyed; for the intellect of the tranquil-minded man soon becomes steady.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna highlights the transformative power of peace in stabilizing the mind and removing sorrow."
          },
          "tags": ["peace", "sorrow", "steadiness"]
        },
        "66": {
          "original_verse": "There is no wisdom in the unsteady; nor is there meditation in him. To the unmeditative there is no peace, and to the peaceless, how can there be happiness?",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna emphasizes the necessity of steadiness, meditation, and peace as prerequisites for true happiness."
          },
          "tags": ["wisdom", "meditation", "happiness"]
        },
        "67": {
          "original_verse": "When the mind runs after the wandering senses, it carries away one’s wisdom as the wind carries away a boat on the water.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna warns against the dangers of an uncontrolled mind and senses, likening it to a boat swept away by the wind."
          },
          "tags": ["mind-control", "senses", "wisdom"]
        },
        "68": {
          "original_verse": "Therefore, O mighty-armed, his wisdom is steady whose senses are completely restrained from the objects of sense.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna reinforces that sense control is essential for attaining steady wisdom and self-realization."
          },
          "tags": ["sense-control", "wisdom", "restraint"]
        },
        "69": {
          "original_verse": "What is night for all beings is the time of waking for the self-controlled; and the time of waking for all beings is night for the sage who sees.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna uses this paradox to describe the enlightened state, where the wise perceive reality differently from ordinary people."
          },
          "tags": ["paradox", "wisdom", "enlightenment"]
        },
        "70": {
          "original_verse": "He attains peace into whom all desires enter as waters enter the ocean, which, filled from all sides, remains unmoved—but not the desirer of desires.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna compares the wise to an ocean that remains steady despite the inflow of desires, highlighting detachment as the key to peace."
          },
          "tags": ["peace", "detachment", "desires"]
        },
        "71": {
          "original_verse": "That man attains peace who, abandoning all desires, moves about without longing, without the sense of 'I' and 'mine.'",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna describes the state of liberation as one free from desires and ego, living in harmony with the Self."
          },
          "tags": ["liberation", "desires", "ego"]
        },
        "72": {
          "original_verse": "This is the divine state, O son of Pritha. Attaining this, one is not deluded. Being established in this even at the end, one attains Brahman.",
          "speaker": "Krishna",
          "commentary": {
            "shankaracharya": "Krishna concludes by describing the ultimate state of enlightenment, where one merges with Brahman and transcends delusion."
          },
          "tags": ["enlightenment", "Brahman", "transcendence"]
        }
        }
      }
    }
  }
  