{
    "chapters": {
        "3": {
            "verses": {
                "1": {
                    "original_verse": "O Janārdana (Krishna), if it be Your opinion that wisdom is superior\nto action, why then do you urge me to horrible action, O Kesava?\nO  Janārdana,  cet,  if  it  be;  te,  Your;  matā,  opinion,  intention;  that\nbuddhih, Wisdom; jyāyasī, is superior; karmanah, to action—.\nIf  the  combination  of  Wisdom  and  action  be  intended  (by  the\nBhagavān),  then  the  means  to  Liberation  is  only  one. (15)  In  that  case,\nArjuna would have done something illogical in separating Wisdom from\naction by saying that Wisdom is superior to action. For, that (Wisdom or\naction, which is a constituent of the combination) cannot be greater than\nthat (combination, even) from the point of view of the result. (16) Similarly,\nwhat Arjuna said by way of censuring the Bhagavān, as it were, in, ‘It has\nbeen stated by the Bhagavān that Wisdom is superior to action, and He\nexhorts me saying, “Undertake action,” which is a source of evil! What may\nbe  the  reason  for  this?’,  and  also  in,  ‘Tatkim,  why  then,  O  Keshava;\nniyojayasi,  do  You  urge;  mām,  me;  to  ghore,  horrible,  cruel;  karmani,\naction; involving injury?’—that (censure) also does not become reasonable.\nOn  the  other  hand,  (17)  if  it  be  supposed  that  the  combination  (of\nKnowledge) with action sanctioned only by the Smrtis has been enjoined\nfor all by the Bhagavān, and Arjuna also comprehended (accordingly), then,\nhow can the statement, ‘Why then do You urge me to horrible action’, be\nrational?\nBesides,\n\u0000यािम\u0000ेणेव वा\u0000येन बुि\u0000 ं मोहयसीव मे।\nतदेकं  वद िनि\u0000\u0000य येन \u0000ेयोऽहमा\u0000ुयाम्॥ २ ॥",
                    "speaker": "Arjuna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "wisdom"
                    ]
                },
                "2": {
                    "original_verse": "You  bewilder  my  understanding,  as  it  were,  by  a  seemingly\nconﬂicting statement! Tell me for certain one of these by which I may attain\nthe highest Good.\n‘Though the Bhagavān speaks lucidly, still, to me who am of a dull\nunderstanding,  the  Bhagavān’s  utterance  appears  to  be  conﬂicting.’\n‘Mohayasi, You bewilder; me, my; buddhim, understanding; iva, as it were;\nvyāmiśrena  iva,  by  that  seemingly  conﬂicting;  vākyena,  statement!  You\nhave surely undertaken to dispel the confusion of my understanding; but\nwhy do You bewilder (it)? Hence I say, “You bewilder my understanding, as\nit were.”’\nHowever, if You (18) think that it is impossible for a single person to\npursue  both  Knowledge  and  action,  which  can  be  undertaken  (only)  by\ndifferent  persons,  then,  that  being  the  case,  vada,  tell  me;  niścitya,  for\ncertain; tadekam, one of these, either Knowledge or action: “This indeed is\nﬁt  for  Arjuna,  according  to  his  understanding,  strength,  and  situation”;\nyena, by which, by one of either Knowledge or action; aham, I; āpnuyām,\nmay attain; śreyah, the highest Good.’\nEven if Knowledge had been spoken of at all by the Bhagavān as being\nsubsidiary to steadfastness in action, how then could there be the desire in\nArjuna to know of only one of them, as expressed in ‘Tell me one of these\ntwo?’ Certainly the Bhagavān did not say, ‘I shall speak of only one among\nKnowledge and action, but surely not of both’, owing to which, Arjuna,\nconsidering it impossible for himself to acquire both, should have prayed\nfor one only!\nThe answer was in accordance with the question:\nShri Hari said:\nलोके ऽि\u0000मि\u0000\u0000िवधा िन\u0000ा पुरा \u0000ो\u0000ता मयानघ।\n\u0000ानयोगेन स\u0000\u0000यान\u0000 कम\u0000योगेन योिगनाम्॥ ३ ॥",
                    "speaker": "Arjuna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "3": {
                    "original_verse": "O unblemished one, two kinds of steadfastness in this world were\nspoken of by Me in the days of yore—through the Yog of Knowledge for\nthe men of realization; through the Yog of Action for the yogīs.\nAnagha, O unblemished one, O sinless one; (19) dvividhā, two kinds of;\nnisṭhā, steadfastness, persistence in what is undertaken; asmin loke, in this\nworld, for the people of the three castes who are qualiﬁed for following the\nscriptures; proktā, were spoken of; mayā, by Me, the omniscient Bhagavān,\nwho had revealed for them the traditional teachings of the Vedas, which are\nthe means of securing prosperity and the highest Goal; purā, in the days of\nyore,  in  the  beginning  of  creation,  after  having  brought  into  being  the\ncreatures.\nNow  then,  which  is  that  steadfastness  of  two  kinds?  In  answer  the\nBhagavān  says:  The  steadfastness  jñānayogena,  through  the  Yog  of\nKnowledge— Knowledge  itself  being  the  Yog  (20)—;  had  been  stated\nsānkhyānām, for the men of realization—those possessed of the Knowledge\narising from the discrimination with regard to the Self and the not-Self,\nthose who have espoused monasticism from the stage of Celibacy itself,\nthose to whom the entity presented by the Vedāntic knowledge has become\nfully  ascertained  (see  Mu.",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "wisdom"
                    ]
                },
                "4": {
                    "original_verse": "A person does not attain freedom from action by abstaining from\naction; nor does he attain fulﬁlment merely through renunciation.\nPurusah, a person; na does not; aśnute, attain; naiskarmyam, freedom\nfrom action, the state of being free from action, steadfastness in the Yog of\nKnowledge, that is the state of abiding in one’s own Self which is free from\naction; anārambhāt, by abstaining; karmanām, from actions—by the non-\nperformance of actions such as sacriﬁces etc. which are or were performed\nin the present or past lives, which are the causes of the puriﬁcation of the\nmind by way of attenuating the sins incurred, and which, by being the cause\nof  that  (puriﬁcation),  become  the  source  of  steadfastness  in  Knowledge\nthrough  the  generation  of  Knowledge,  as  stated  in  the  Smrti  (text),\n‘Knowledge arises in a person from the attenuation of sinful acts’ (22) (Mbh.\nŚā.",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "5": {
                    "original_verse": "Because,  no  one  ever  remains  even  for  a  moment  without  doing\nwork. For all are made to work under compulsion by the gunas born of\nNature.\nHi, because; na kaścit, no one; jātu, ever; tisṭhati, remains; api, even;\nfor so much time as a ksanam, moment; akarma-krt, without doing work.\nWhy? Hi,  for;  sarvah,  all  creatures;  kāryate  karma,  are  made  to  work;\nverily avaśah, under compulsion; gunaih, by the gunas—sattva (goodness);\nrajas (activity), and tamas (mental darkness); prakrti-jaih, born of Nature.\nThe word ‘unenlightened’ has to be added to the sentence, since the men of\nrealization have been spoken of separately in, ‘who is not distracted by the\nthree  gunas  (qualities)’  (",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "6": {
                    "original_verse": "One,  who  after  withdrawing  the  organs  of  action,  sits  mentally\nrecollecting the objects of the senses, that one, of deluded mind, is called a\nhypocrite.\nYah,  one  who;  samyamya,  after  withdrawing;  karma-indriyāni,  the\norgans  of  action—hands  etc.;  āste,  sits;  manasā,  mentally;  smaran,\nrecollecting, thinking; indriya-arthān, the objects of the senses; sah, that\none; vimūḍ ha-ātmā, of deluded mind; ucyate, is called; mithyā-ācārah, a\nhypocrite, a sinful person.\nयि\u0000\u0000वि\u0000\u0000यािण मनसा िनय\u0000यारभतेऽजु\u0000न।\nकम\u0000ि\u0000\u0000यै: कम\u0000योगमस\u0000त: स िविश\u0000यते॥ ७ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "7": {
                    "original_verse": "But, O Arjuna, one who engages in Karma-Yog with the organs of\naction, controlling the organs with the mind and becoming unattached—that\none excels.\nTu, but, on the other hand, O Arjuna; yah, one who is unenlightened and\nwho is eligible for action; ārabhate, engages in;—what does he engage in?\nThe Bhagavān says in answer—karma-Yogm, Karma Yog; karma-indriyaih,\nwith the organs of action, with speech, hands, etc.; niyamya, controlling;\nindriyāni, the sense-organs; manasā, with the mind; and becoming asaktah\nunattached; (23) sah, that one; viśisyate, excels the other one, the hypocrite.\nThis being so, therefore,\nिनयत ं कु \u0000 कम\u0000 \u0000व ं कम\u0000 \u0000यायो \u0000कम\u0000ण:।\nशरीरया\u0000ािप च ते न \u0000िस\u0000\u0000येदकम\u0000ण:॥ ८ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "8": {
                    "original_verse": "You perform the obligatory duties, for action is superior to inaction.\nAnd,  through  inaction,  even  the  maintenance  of  your  body  will  not  be\npossible.\nTvam, you, O Arjuna; kuru, perform; niyatam, the obligatory; karma,\nduties,  those  daily  obligatory  duties  (nitya-karmas)  for  which  one  is\ncompetent (according to the scriptures), and which are not heard of (24) as\nproductive of any result; hi, for, from the point of view of result; karma,\naction; is jyāyah, superior; akarmanah, to inaction, to non-performance (of\nduties). Why? Ca, and; akarmanah, through inaction; api, even; te śarīra-\nyātrā, the maintenance of your body; na prasiddhyet, will not be possible.\nTherefore, the distinction between action and inaction is obvious in this\nworld.\n‘And as regards your idea that action should not be undertaken because\nit leads to bondage—that too is wrong.’ How?\nय\u0000ाथ\u0000\u0000कम\u0000णोऽ\u0000य\u0000 लोकोऽय ं कम\u0000ब\u0000धन:।\nतदथ\u0000 ं कम\u0000 कौ\u0000तेय मु\u0000तस\u0000: समाचर॥ ९ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "9": {
                    "original_verse": "This man becomes bound by actions other than that action meant for\nBhagavān. Without being attached, O son of Kuntī, you perform actions for\nHim.\nAyam,  this;  lokah,  man,  the  one  who  is  eligible  for  action;  karma-\nbandhanah, becomes bound by actions—the person who has karma as his\nbondage  (bandhana)  is  karma-bandhanah—;  anyatra,  other  than;  that\nkarmanah, action; yajñārthāt, meant for Bhagavān; not by that meant for\nBhagavān.  According  to  the  Vedic  text,  ‘Sacriﬁce  is  verily  Visnu’  (Tai.\nSaṁ .",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "10": {
                    "original_verse": "In the days of yore, having created the beings together with the\nsacriﬁces, Prajāpati said: ‘By this you multiply. Let this be your yielder of\ncoveted objects of desire.’\nPurā, in the days of yore, in the beginning of creation; srsṭvā, having\ncreated;  prajāh,  the  beings,  the  people  of  the  three  castes;  saha-yajñāh,\ntogether with the sacriﬁces; Prajāpati, the creator of beings, uvāca, said;\n‘Anena, by this sacriﬁce; prasavisyadhvam, you multiply.’ Prasava means\norigination, growth. ‘You accomplish that. Esah astu, let this sacriﬁce be;\nvah, your; isṭa-kāma-dhuk, yielder of coveted objects of desire.’ That which\nyields (dhuk) coveted (isṭa) objects of desire (kāma), particular results, is\nisṭa-kāma-dhuk.\nHow?\nदेवान् भावयतानने  ते देवा भावय\u0000तु व:।\nपर\u0000पर ं भावय\u0000त: \u0000ेय: परमवा\u0000\u0000यथ॥ १ १ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "11": {
                    "original_verse": "‘You  nourish  the  gods  with  this.  Let  those  gods  nourish  you.\nNourishing one another, you shall attain the supreme Good.’\n‘Bhāvayata, you nourish; devān, the gods, Indra and others; anena, with\nthis sacriﬁce. Let te devāh, those gods; bhāvayantu, nourish; vah, you—\nmake  you  contented  with  rainfall  etc.  Thus  bhāvayantah,  nourishing;\nparasparam,  one  another;  avāpsyatha,  you  shall  attain;  the  param,\nsupreme;  sreyah,  Good,  called  Liberation,  through  the  attainment  of\nKnowledge;’  or,  ‘you  shall  attain  heaven—which  is  meant  by  param\nśreyah.’ (25)\nMoreover,\nइ\u0000ा\u0000भोगाि\u0000ह वो देवा दा\u0000य\u0000ते य\u0000भािवता:।\nतैद\u0000\u0000ान\u0000दायै\u0000यो यो भु\u0000\u0000ते \u0000तेन एव स:॥ १ २ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "12": {
                    "original_verse": "‘Being nourished by sacriﬁces, the gods will indeed give you the\ncoveted enjoyments. He is certainly a thief who enjoys what have been\ngiven by them without offering (these) to them.’\n‘Yajña-bhāvitāh, being nourished, that is being satisﬁed, by sacriﬁces;\ndevāh, the gods; dāsyante hi, will indeed give, will distribute; among vah,\nyou; the isṭān, coveted; bhogān, enjoyments, such as wife, children, and\ncattle. Sah, he; is eva, certainly; a stenah, thief, a stealer of the wealth of\ngods and others; yah, who; bhunkte, enjoys, gratiﬁes only his own body and\norgans; with dattān, what enjoyable things have been given; taih, by them,\nby the gods; apradāya, without offering (these); ebhyah, to them, that is\nwithout repaying the debt (26) to them.’\nय\u0000िश\u0000ािशन: स\u0000तो मु\u0000य\u0000ते सव\u0000िकि\u0000बषै:।\nभु\u0000ते ते \u0000वघ ं पापा ये पच\u0000\u0000या\u0000मकारणात्॥ १ ३ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "13": {
                    "original_verse": "By becoming partakers of the remnants of sacriﬁces, they become\nfreed from all sins. But the unholy persons who cook for themselves, they\nincur sin.\nThose again, who are yajña-śisṭa-aśinah, partakers of the remnants of\nsacriﬁces,  who,  after  making  offering  to  the  gods  and  others,  (27)  are\nhabituated  to  eat  the  remnants  (of  those  offerings),  called  nectar;  they,\nsantah, by being (so); mucyante, become freed; sarva-kilbisaih, from all\nsins—from those sins incurred through the ﬁve things, (28) namely oven etc.,\nand  also  from  those  others  incurred  owing  to  injury  etc.,  caused\ninadvertently. Tu, but; the pāpāh, unholy persons, who are selﬁsh; ye, who;\npacanti,  cook;  ātma-kāranāt,  for  themselves;  te,  they,  being  themselves\nsinful; bhuñjate, incur; agham, sin.\nFor  the  following  reasons  also  actions  should  be  undertaken  by  an\neligible person. Action is deﬁnitely the cause of the movement of the wheel\nof the world. How? This is being answered:\nअ\u0000ा\u0000वि\u0000त भूतािन पज\u0000\u0000याद\u0000स\u0000भव:।\nय\u0000ा\u0000वित पज\u0000\u0000यो य\u0000: कम\u0000समु\u0000व:॥ १ ४ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "14": {
                    "original_verse": "From food are born the creatures; the origin of food is from rainfall;\nrainfall originates from sacriﬁce; sacriﬁce has action as its origin.\nIt is a matter of direct perception that annāt, from food, which is eaten\nand is transformed into blood and semen; bhavanti, are born; bhūtāni, the\ncreatures. Anna-sambhavah, the origin of food; is parjanyāt, from rainfall.\nParjanyah, rainfall; bhavati, originates; from yajñāt, from sacriﬁce. This\naccords with the Smrti, ‘The oblation properly poured into ﬁre reaches the\nsun. From the sun comes rain, from rain comes food, and from that the\ncreatures’ (Ma. Sm.",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "15": {
                    "original_verse": "Know  that  action  has  the  Veda  as  its  origin;  the  Vedas  has  the\nImmutable as its source. Hence, the all-pervading Veda is for ever based on\nsacriﬁce.\nAgain, (30) viddhi, know; that karma, action; is brahmodbhavam, it has\nBrahma, the Veda, as its udbhavam, origin. (31) Further, Brahma, called the\nVeda, is aksara-samudbhavam, it has aksara, the Immutable, Brahman, the\nsupreme Self, as its source. This is the meaning. Since the Veda came out,\nlike the breath of a man, from the supreme Self Itself, called the Immutable,\ntherefore the Veda, being the revealer of everything, is sarva-gatam, all-\npervading.  Even  though  all-pervading,  the  Veda  is  nityam,  for  ever;\npratisṭhitam,  based;  yajñe,  on  sacriﬁce,  because  the  injunctions  about\nsacriﬁces predominate in it.\nएव ं \u0000वित\u0000त ं च\u0000ं  नानुवत\u0000यतीह य:।\nअघायुिरि\u0000\u0000यारामो मोघ ं पाथ\u0000 स जीवित॥ १ ६ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "16": {
                    "original_verse": "O Pārtha, he lives in vain who does not follow here the wheel thus\nset in motion, whose life is sinful, and who indulges in the senses.\nO Pārtha, sah,  he;  jīvati,  lives;  mogham,  in  vain;  yah,  who,  though\ncompetent for action; na anuvartayati, does not follow; iha, here, in the\nworld; cakram,  the  wheel  of  the  world;  evam,  thus;  pravartitam,  set  in\nmotion, by Bhagavān, on the basis of the Vedas and the sacriﬁces; aghāyuh,\nwhose life (āyuh) is sinful (agham), that is whose life is vile; and indriya-\nārāmah, who indulges in the senses—who has his ārāma, sport, enjoyment,\nwith objects, indriyaih, through the senses.\nTherefore, the gist of the topic under discussion is that action must be\nundertaken by one who is qualiﬁed (for action) but is unenlightened. In the\nverses beginning from, ‘A person does not attain freedom from action by\nabstaining from action’ (4) and ending with, ‘You perform the obligatory\nduties…. And, through inaction, even the maintenance of your body will\nnot be possible’ (8), it has been proved that before one attains ﬁtness for\nsteadfastness  in  the  knowledge  of  the  Self,  it  is  the  bounden  duty  of  a\nperson  who  is  qualiﬁed  for  action,  but  is  not  enlightened,  to  undertake\nKarma-Yog for that purpose. And then, also in the verses commencing from\n‘(This man becomes bound) by actions other than that action meant for\nBhagavān’ (9) and ending with ‘O Pārtha, he lives in vain,’ many reasons\n(32)  have  been  incidentally  stated  as  to  why  a  competent  person  has  to\nundertake actions; and the evils arising from their non-performance have\nalso been emphatically declared.\nSuch being the conclusion, the question arises whether the wheel thus\nset in motion should be followed by all, or only by one who is ignorant of\nthe Self and has not attained to the steadfastness which is ﬁt to be practised\nby the Sānkhyas, the knowers of the Self, through the Yog of Knowledge\nonly, and which is acquired by one ignorant of the Self through the means\nof  the  practice  of  Karma-Yog  mentioned  above?  Either  anticipating\nArjuna’s question to this effect, or in order to make the meaning of the\nscripture (Gītā) clearly understood, the Bhagavān, revealing out of His own\naccord  that  the  following  substance  of  the  Upanisads—Becoming  freed\nfrom false knowledge by knowing this very Self, the Brāhmanas renounce\nwhat is a compulsory duty for those having false knowledge, namely, desire\nfor  sons,  etc.,  and  then  lead  a  mendicant  life  just  for  the  purpose  of\nmaintaining the body; they have no duty to perform other than steadfastness\nin the knowledge of the Self (cf. Br.",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "wisdom",
                        "duty"
                    ]
                },
                "17": {
                    "original_verse": "But that man who rejoices only in the Self and is satisﬁed with the\nSelf, and is contented only in the Self—for him there is no duty to perform.\nTu,  but;  that  mānavah,  man,  the  sannyāsin,  the  man  of  Knowledge,\nsteadfast  in  the  knowledge  of  the  Self;  yah,  who;  ātmaratih  eva  syāt,\nrejoices only in the Self—not in the sense objects; and ātma-trptah, who is\nsatisﬁed  only  with  the  Self—not  with  food  and  drink;  and  is  santusṭah,\ncontented; eva, only; ātmani, in the Self; tasya, for him; na vidyate, there is\nno; kāryam, duty (33) to perform. (34)\nAll people surely feel contented by acquiring an external thing. But this\none, without depending on it, remains contented only with the Self; that is\nto say, he remains detached from everything. The idea is that, for a man\nwho is such a knower of the Self, there is no duty to undertake.\nनवै  त\u0000य कृ तेनाथ\u0000 नाकृ तेनहे  क\u0000न।\nन चा\u0000य सव\u0000भूतेषु कि\u0000दथ\u0000\u0000यपा\u0000य:॥ १ ८ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "wisdom",
                        "duty"
                    ]
                },
                "18": {
                    "original_verse": "For him there is no concern here at all with performing action; nor\nany  (concern)  with  non-performance.  Moreover,  for  him  there  is  no\ndependence on any object to serve any purpose.\nMoreover, tasya, for him, who rejoices in the supreme Self; na, there is\nno; artham, concern; eva, at all; krtena, with performing action.\nObjection: In that case, let there be some evil called sin owing to non-\nperformance!\nReply: Iha, here, in this world; na, nor is there; for him kaścana, any\n(concern); akrtena, with non-performance. Certainly there is no evil in the\nform of incurring sin or in the form of self-destruction. Ca, moreover; asya,\nfor  him;  na  asti,  there  is  no;  kaścit  artha-vyapāśrayah  sarva-bhūtesu,\ndependence on any object, from Brahmā to an unmoving thing, to serve any\npurpose. Vyapāśrayah is the same as vyapāśrayanam, dependence, which is\npossible of being created by action prompted by necessity. (For him) there\nis no end to gain by depending on any particular object, due to which there\ncan be some action for that purpose.\n‘You  (Arjuna)  are  not  established  in  this  fullest  realization  which  is\ncomparable to a ﬂood all around.’\nत\u0000मादस\u0000त: सतत ं काय\u0000 ं कम\u0000 समाचर।\nअस\u0000तो \u0000ाचरन् कम\u0000 परमापषेित पू\u0000ष:॥ १ ९ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "19": {
                    "original_verse": "Therefore,  remaining  unattached,  always  perform  the  obligatory\nduty, for, by performing (one’s) duty without attachment, a person attains\nthe Highest.\nSince this is so, therefore, asaktah, remaining unattached; samācara,\nperform; satatam, always; kāryam, the obligatory; daily karma, duty; hi,\nfor;  ācaran,  by  performing;  (one’s)  karma,  duty;  asaktah,  without\nattachment, by doing work as a dedication to Bhagavān; purusah, a person;\nāpnoti, attains; param, the Highest, Liberation, through the puriﬁcation of\nthe mind. This is meaning.\nAnd (you should perform your duty) for the following reason also:\nकम\u0000णैव िह संिसि\u0000माि\u0000थता जनकादय:।\nलोकसं\u0000हमेवािप संप\u0000यन् कतु\u0000मह\u0000िस॥ २ ० ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "20": {
                    "original_verse": "For  Janaka  and  others  strove  to  attain  Liberation through  action\nitself.  You  ought  to  perform  (your  duties)  keeping  also  in  view  the\nprevention of mankind from going astray.\nHi, for; in the olden days, the learned Ksatriyas, janakādayah, Janaka\nand  others  such  as  Aśvapati;  āsthitāh,  strove  to  attain;  saṁsiddhim,\nLiberation; karmanā eva, through action itself.\nIf  it  be  that  they  were  possessed  of  the  fullest  realization,  then  the\nmeaning is that they remained established in Liberation while continuing,\nbecause of past momentum, to be associated with action itself—without\nrenouncing  it—with  a  view  to  preventing  mankind  from  going  astray.\nAgain, if (it be that) Janaka and others had not attained fullest realization,\nthen, they gradually became established in Liberation through action which\nis a means for the puriﬁcation of the mind. The verse is to be explained\nthus.\nOn the other hand, if you think, ‘Obligatory duty was performed even\nby Janaka and others of olden days who were surely unenlightened. (35)\nThere by it does not follow that action has to be undertaken by somebody\nelse  who  has  the  fullest  enlightenment  and  has  reached  his  Goal’,\nnevertheless, tvam, you, who are under the inﬂuence of past actions; arhasi,\nought; kartum, to perform (your duties); sampaśyan api, keeping also in\nview; loka-sangraham, (36) the prevention of mankind from going astray;\neven that purpose.\nBy whom, and how, is mankind to be prevented from going astray? That\nis being stated: (37)\nय\u0000दाचरित \u0000े\u0000\u0000त\u0000देवेतरो जन:।\nस य\u0000\u0000माणं कु \u0000ते लोक\u0000तदनुवत\u0000ते॥ २ १ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "21": {
                    "original_verse": "Whatever  a  superior  person  does,  another  person  does  that  very\nthing! Whatever he upholds as authority, an ordinary person follows that.\nYat  yat,  (38)  whatever  action;  a  śresṭhah,  superior  person,  a  leader;\nācarati, does; itarah, another; janah, person, who follows him; does tat tat\neva, that very action. Further, yat, whatever; sah, he, the superior person;\nkurute, upholds; as pramānam, authority, be it Vedic or secular; lokah, an\nordinary person; anuvartate, follows; tat, that, that is he accepts that very\nthing as authoritative.\n‘If you have a doubt here with regard to the duty of preventing people\nfrom straying, then why do you not observe Me?’\nन मे पाथ\u0000ि\u0000त कत\u0000\u0000य ं ि\u0000षु लोके षु िकं चन।\nनानवा\u0000तमवा\u0000त\u0000य ं वत\u0000 एव च कम\u0000िण॥ २ २ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "22": {
                    "original_verse": "In all the three worlds, O Pārtha, there is no duty whatsoever for Me\n(to fulﬁl); nothing remains unachieved or to be achieved. (39) (Still) do I\ncontinue in action.\nO Pārtha, na asti, there is no; kartavyam, duty; kiñcana, whatsoever;\nme, for Me (to fulﬁl); even trisu lokesu, in all the three worlds. Why? There\nis na anavāptam, nothing (that remains) unachieved; or avāptavyam, to be\nachieved. Still varte eva, do I continue; karmani, in action.\nयिद \u0000ह ं न वत\u0000य ं जातु कम\u0000\u0000यति\u0000\u0000त:।\nमम व\u0000म\u0000नुवत\u0000\u0000ते मनु\u0000या: पाथ\u0000 सव\u0000श:॥ २ ३ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "23": {
                    "original_verse": "For, O Pārtha, if at any time I do not continue (40) vigilantly  in\naction, men will follow My path in every way.\nAgain,  O  Pārtha,  yadi,  if;  jātu,  at  any  time;  aham,  I;  na,  do  not;\nvarteyam, continue; atandritah, vigilantly, untiringly; karmani, in action;\nmanusyāh,  men:  anuvartante,  will  follow;  mama,  My;  vartma,  path;\nsarvaśah, in every way, I being the Highest.\nAnd if that be so, what is the harm? In reply the Bhagavān says: (41)\nउ\u0000सीदेयुिरमे लोका न कु य\u0000  कम\u0000 चेदहम्।\nस\u0000र\u0000य च कत\u0000 \u0000यामुपह\u0000यािममा: \u0000जा:॥ २ ४ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "24": {
                    "original_verse": "These worlds will be ruined if I do not perform action. And I shall\nbecome the agent of intermingling (of castes), and shall be destroying these\nbeings.\nCet, if; aham, I; na kuryām, do not perform; karma, action; all ime,\nthese; lokāh, worlds; utsīdeyuh, will be ruined, owing to the absence of\nwork responsible for the maintenance of the worlds. Ca, and, further; syām,\nI shall become; kartā, the agent; sankarasya, of intermingling (of castes).\nConsequently,  upahanyām,  I  shall  be  destroying;  imāh,  these;  prajāh,\nbeings. That is to say, I who am engaged in helping the creatures, shall be\ndestroying them. This would be unbeﬁtting of Me, who am Bhagavān.\n‘On the other hand, if, like Me, you or some one else possesses the\nconviction of having attained Perfection and is a knower of the Self, it is a\nduty of such a one, too, to help others even if there be no obligation on his\nown part.’\nस\u0000ता: कम\u0000\u0000यिव\u0000\u0000सो यथा कु व\u0000ि\u0000त भारत।\nकु य\u0000ि\u0000\u0000\u0000\u0000तथाऽस\u0000ति\u0000कीषु\u0000ल\u0000कसं\u0000हम्॥ २ ५ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "25": {
                    "original_verse": "O scion of the Bharata dynasty, as the unenlightened people act with\nattachment  to  work,  so  should  the  enlightened  person  act,  without\nattachment, being desirous of the prevention of people from going astray.\nO  scion  of  the  Bharata  dynasty,  yathā,  as;  some  avidvāṁsah,\nunenlightened people; kurvanti, act; saktāh, with attachment; karmani, to\nwork, (thinking) ‘The reward of this work will accrue to me’; tathā, so;\nshould vidvān, the enlightened person, the knower of the Self; kuryāt, act;\nasaktah, without attachment, remaining unattached. (42) Why does he (the\nenlightened  person)  act  like  him  (the  former)?  Listen  to  that:  Cikīrsuh,\nbeing  desirous  of  achieving;  lokasangraham,  prevention  of  people  from\ngoing astray.\n‘Neither for Me who am a knower of the Self, nor for any other (knower\nof the Self) who wants thus prevent people from going astray, is there any\nduty apart from working for the welfare of the world. Hence, the following\nadvice is being given to such a knower of the Self:’\nन बुि\u0000भेद ं जनयेद\u0000ान\u0000 कम\u0000सि\u0000नाम्।\nजोषये\u0000सव\u0000कम\u0000िण िव\u0000ा\u0000यु\u0000त: समाचरन्॥ २ ६ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "26": {
                    "original_verse": "The enlightened man should not create disturbance in the beliefs of\nthe ignorant, who are attached to work. Working, while himself remaining\ndiligent, (43) he should make them do (44) all the duties.\nVidvān,  the  enlightened  man;  na janayet,  should  not  create;  buddhi-\nbhedam, disturbance in the beliefs—disturbance in the ﬁrm belief, ‘This has\nto be done; and the result of this action is to be reaped by me’; ajñānām, of\nthe  ignorant,  of  the  non-discriminating  ones;  karma-sanginām,  who  are\nattached to work. But what should he do? Himself samācaran, working,\nperforming those very activities of the ignorant; yuktah, while remaining\ndiligent; josayet, he should make them do; sarva-karmāni, all the duties.\nHow does an unillumined, ignorant person become attached to actions?\nIn reply the Bhagavān says:\n\u0000कृ ते: ि\u0000यमाणािन गुणै: कम\u0000िण सव\u0000श:।\nअह\u0000ारिवमूढा\u0000मा कत\u0000हिमित म\u0000यते॥ २ ७ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "27": {
                    "original_verse": "While actions are being done in every way by the gunas (qualities)\nof Nature, one who is deluded by egoism thinks thus: ‘I am the doer.’\nKarmāni kriyamānāni, while actions, secular and scriptural, are being\ndone;  sarvaśah,  in  ever  way;  gunaih,  by  the  gunas,  (that  is)  by  the\nmodiﬁcations in the form of body and organs; (born) prakrteh, of Nature—\nNature, (otherwise known as) Pradhāna, (45) being the state of equilibrium\nof the three qualities of sattva, rajas and tamas; ahankāra-vimūḍ ha-ātmā,\none who is deluded by egoism; manyate, thinks; iti, thus; ‘Aham kartā, I am\nthe doer.’\nAhankāra is self-identiﬁcation with the aggregate of body and organs.\nHe  whose  ātmā,  mind,  is  vimūḍ ham,  deluded  in  diverse  ways,  by  that\n(ahankāra)  is  ahankāra-vimūḍ ha-ātmā.  He  who  imagines  the\ncharacteristics  of  the  body  and  organs  to  be  his  own,  who  has  self-\nidentiﬁcation with the body and the organs, and who, through ignorance,\nbelieves the activities to be his own—, he thinks, ‘I am the doer of those\ndiverse activities.’\nत\u0000\u0000विव\u0000ु महाबाहो गुणकम\u0000िवभागयो:।\nगुणा गुणेषु वत\u0000\u0000त इित म\u0000वा न स\u0000जते॥ २ ८ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "28": {
                    "original_verse": "But, O mighty-armed one, the one who is a knower of the facts\nabout the varieties of the gunas (qualities) and actions does not become\nattached, thinking thus: ‘The organs rest (act) on the objects of the organs.’\nTu, but, on the other hand; he who is a knower, tattva-vit, a knower of\nthe  facts;—knower  of  what  kinds  of  facts?—guna-karma-vibhāgayoh,\nabout the varieties of the gunas and actions, that is a knower of the diversity\nof the gunas and the diversity of actions; (46) na sajjate, does not become\nattached; iti matvā, thinking thus; ‘Gunāh, the gunas in the form of organs;\n—not the Self—vartante, rest (act); gunesu, on the gunas in the form of\nobjects of the organs.’\n\u0000कृ तेगु\u0000णसंमूढा: स\u0000ज\u0000ते गुणकम\u0000सु।\nतानकृ \u0000\u0000निवदो म\u0000दान् कृ \u0000\u0000निव\u0000 िवचालयेत्॥ २ ९ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "29": {
                    "original_verse": "Those  who  are  wholly  deluded  by  the  gunas of  Nature  become\nattached to the activities of the gunas. The knower of the All should not\ndisturb those of dull intellect, who do not know the All.\nThose again, guna-sammūḍ hāh, who are wholly deluded by the gunas;\nprakrteh,  of  Nature;  sajjante,  become  attached;  guna  karmasu,  to  the\nactivities of the gunas, thinking, ‘We do actions for results.’ Krtsna-vit, the\nknower of the All, one who is himself a knower of the Self; na vicālayet,\nshould  not  disturb;  tān,  those  who  are  attached  to  actions;  (who  are)\nmandān, of dull intellect; akrtsnavidah, who do not know the All, who are\nall  attention  on  the  results  of  actions.  Unsettling  of  beliefs  is  itself  the\ndisturbance. That he should not do. This is the idea.\nAgain, in what manner should duties be undertaken by a seeker after\nLiberation who is not enlightened, who is qualiﬁed for actions (rites and\nduties)? As to this, the answer is being stated:\nमिय सव\u0000िण कम\u0000िण सं\u0000य\u0000या\u0000या\u0000मचेतसा।\nिनराशीिन\u0000म\u0000मो भू\u0000वा यु\u0000य\u0000व िवगत\u0000वर:॥ ३ ० ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action"
                    ]
                },
                "30": {
                    "original_verse": "Devoid of the fever of the Ātman, engage in battle by dedicating all\nactions to Me, with (your) mind intent on the Self, and becoming free from\nexpectations and egoism.\nVigata-jvarah, devoid of the fever of the Ātman, that is being free from\nrepentance, without remorse; yuddhyasva, engage in battle; sannyasya, by\ndedicating; sarvāni, all; karmāni, actions; mayi, to Me, who am Vāsudeva,\nthe omniscient supreme Bhagavān, the Self of all; adhyātma-cetasā, with\n(your) mind intent on the Self—with discriminating wisdom, with this idea,\n‘I am an agent, and I work for Bhagavān as a servant’; and further, bhūtvā,\nbecoming; nirāśīh, free from expectations; (47) and nirmamah, free  from\negoism.  You  from  whom  has  vanished  the  idea,  ‘(this  is)  mine’,  are\nnirmamah.\nये मे मतिमद ं िन\u0000यमनुित\u0000ि\u0000त मानवा:।\n\u0000\u0000ाव\u0000तोऽनसूय\u0000तो मु\u0000य\u0000ते तेऽिप कम\u0000िभ:॥ ३ १ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "wisdom"
                    ]
                },
                "31": {
                    "original_verse": "Those men who ever follow this teaching of Mine with faith and\nwithout cavil, they also become freed from actions.\nYe,  those;  mānavāh,  men;  who  (nityam,  ever;)  anutisṭhanti,  follow\naccordingly; me matam, My teaching—this teaching of Mine, namely that\n‘duty  must  be  performed’,  which  has  been  stated  with  valid  reasoning;\nsraddhāvantah,  with  faith;  and  anasūyantah,  without  cavil,  without\ndetracting Me, Vāsudeva, the Teacher; (48) te api, they also, who are such;\nmucyante, become freed; karmabhih, from actions called the righteous and\nthe unrighteous.\nये \u0000वेतद\u0000यसूय\u0000तो नानुित\u0000ि\u0000त मे मतम्।\nसव\u0000\u0000ानिवमूढ\u0000\u0000ताि\u0000वि\u0000 न\u0000ानचेतस:॥ ३ २ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "32": {
                    "original_verse": "But those who, decrying (49) this, do not follow My teaching, know\nthem—who are deluded about all knowledge (50) and who are devoid of\ndiscrimination—to have gone to ruin.\nTu,  but;  ye,  those  who  are  the  opposite  of  them  (the  former);  who\nabhyasūyantah,  decrying;  etat,  this  instruction  of  Mine;  na,  do  not;\nanutisṭhanti, follow; me, My; matam, teaching, they are deluded in various\nways with respect to all knowledge. Viddhi, know; tān, them; sarva-jñāna-\nvimūḍ hān, who are deluded about all knowledge; acetasah, who are devoid\nof discrimination; nasṭān, to have gone to ruin.\n‘For what reason, again, do they not follow your teachings, perform\nduties that are not theirs and not follow their own duties? How is it that by\nremaining opposed to You, they do not fear the evil which will arise from\ntransgressing Your commandments? As to that, the Bhagavān says:\nसदशृ ं चे\u0000ते \u0000व\u0000या: \u0000कृ ते\u0000\u0000नवानिप।\n\u0000कृ ित ं याि\u0000त भूतािन िन\u0000ह: िकं  किर\u0000यित॥ ३ ३ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "wisdom"
                    ]
                },
                "33": {
                    "original_verse": "Even a man of wisdom behaves according to his own nature. Beings\nfollow (their) nature. What can restraint do?\nApi,  even;  jñānavān,  a  man  of  wisdom—what  to  speak  of  a  fool!;\ncesṭate,  behaves;  sadrśam,  according  to;—what?  svasyāh,  his  own;\nprakrteh,  nature.  Nature  means  the  impressions  of  virtue,  vice,  etc.  (51)\nacquired  in  the  past  (lives)  and  which  become  manifest  at  the\ncommencement of the present life. All creatures (behave) according to that\nonly.  Therefore,  bhūtāni,  beings;  yānti,  follow;  (their)  prakrtim,  nature.\nNigrahah kim karisyati, what can restraint do, be it from Me or anybody\nelse?\nIf all beings behave only according to their own nature—and there is\nnone without his nature—, then, since there arises the contingency of the\nscriptures  becoming  purposeless  owing  to  the  absence  of  any  scope  for\npersonal effort, therefore the following is being stated:\nइि\u0000\u0000य\u0000येि\u0000\u0000य\u0000याथ\u0000 राग\u0000ेषौ \u0000यवि\u0000थतौ।\nतयोन\u0000 वशमाग\u0000छे\u0000ौ \u0000\u0000य पिरपि\u0000थनौ॥ ३ ४ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "wisdom"
                    ]
                },
                "34": {
                    "original_verse": "Attraction and repulsion are ordained with regard to the objects of\nall the organs. One should not come under the sway of these two, because\nthey are his adversaries.\nRāga-dvesau,  attraction  and  repulsion,  in  the  following  manner—\nattraction  towards  desirable  things,  and  repulsion  against  undesirable\nthings; (vyavasthitau, are ordained,) are sure to occur, arthe, with regard to\nobjects such as sound etc.; indriyasya indriyasya, of all the organs, with\nregard to each of the organs.\nAs to that, the scope of personal effort and scriptural purpose are being\nstated as follows: One who is engaged in the subject-matter of the scriptures\nshould, in the very beginning, not come under the inﬂuence of love and\nhatred. For, that which is the nature of a person impels him to his actions,\nverily under the inﬂuence of love and hatred. And then follow the rejection\nof one’s own duty and the undertaking of somebody else’s duty. On the\nother hand, when a person controls love and hatred with the help of their\nopposites, (52) then he becomes mindful only of the scriptural teachings; he\nceases to be led by his nature.\nTherefore, na āgacchet, one should not come; vaśam, under the sway;\ntayoh, of these two, of love and hatred; hi because; tau, they; are asya, his,\nthis person’s pari-panthinau, adversaries, who, like robbers, put obstacles\non his way to Liberation. This is the meaning.\nIn this world, one impelled by love and hatred misinterprets even the\nteaching of the scriptures, and thinks that somebody else’s duty, too, has to\nbe undertaken just because it is a duty! That is wrong:\n\u0000ेयान् \u0000वधम\u0000 िवगुण: परधम\u0000त् \u0000वनुि\u0000तात्।\n\u0000वधम\u0000 िनधन ं \u0000ेय: परधम\u0000 भयावह:॥ ३ ५ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "duty"
                    ]
                },
                "35": {
                    "original_verse": "One’s own duty, (53) though defective, is superior to another’s duty\nwell-performed. Death is better while engaged in one’s own duty; another’s\nduty is fraught with fear.\nSvadharmah,  one’s  own  duty;  being  practised  even  though  vigunah,\ndefective, deﬁcient; is śreyān, superior to, more commendable than; para-\ndharmāt,  another’s  duty;  though  svanusṭhitāt,  well-performed,\nmeritoriously  performed.  Even nidhanam, death;  is  śreyah,  better;  while\nengaged svadharme, in one’s own duty, as compared with remaining alive\nwhile  engaged  in  somebody  else’s duty. Why? Para-dharmah, another’s\nduty; is bhayāvahah, fraught with fear, since it invites dangers such as hell\netc.\nAlthough the root cause of evil was stated in, ‘In the case of a person\nwho  dwells  on  objects’  (",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "duty"
                    ]
                },
                "36": {
                    "original_verse": "Now then, O scion of the Vrsni dynasty (Krishna), impelled by what\ndoes this man commit sin even against his wish, being constrained by force,\nas it were?\nAtha,  now  then;  vārsneya,  O  scion  of  the  Vrsni  dynasty;  being\nprayuktah, impelled; kena, by what acting as the cause; as a servant is by a\nking, does ayam, this; purusah, man; carati, commit; pāpam, sin, a sinful\nact;  api,  even;  anicchan,  against  his  wish,  though  not  himself  willing;\nniyojitah, being constrained; balāt, by force; iva, as it were—as if by a king,\nwhich illustration has already been given?\nThe  Bhagavān  (Bhaga-vān)  said:  ‘You  hear  about  that  enemy,  the\nsource of all evil, of which you ask—.’\n‘Bhaga is said to consist of all kinds of majesty, virtue, fame, beauty,\ndetachment  as  well  as  Liberation,  (54)  (V.P.",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "37": {
                    "original_verse": "This  desire,  this  anger,  born  of  the  quality  of  rajas,  is  a  great\ndevourer, a great sinner. Know this to be the enemy here.\nEsāh, this; kāmah, desire, is the enemy of the whole world, because of\nwhich the creatures incur all evil. This desire when obstructed in any way\nturns  into  anger.  Therefore,  krodhah,  anger,  is  also  identical  with  this\n(desire). It is rajoguna-samudbhavah, born of the quality of rajas; or, it is\nthe origin of the quality of rajas. For, when desire comes into being, it\ninstigates a person by arousing rajas. People who are engaged in service\netc., which are effects of rajas, and who are stricken with sorrow are heard\nto lament, ‘I have been led to act by desire indeed!’ It is mahā-aśanah, a\ngreat devourer, whose food is enormous. And hence, indeed, it is mahā-\npāpmā, a great sinner. For a being commits sin when goaded by desire.\nTherefore, viddhi, know; enam, this desire; to be vairinam, the enemy; iha,\nhere in this world.\nWith the help of examples the Bhagavān explains how it is an enemy:\nधूमेनािव\u0000यते वि\u0000य\u0000थाऽदश\u0000 मलेन च।\nयथो\u0000बेनावृतो गभ\u0000\u0000तथा तेनदे मावृतम्॥ ३ ८ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "38": {
                    "original_verse": "As ﬁre is enveloped by smoke, as a mirror by dirt, and as a foetus\nremains enclosed in the womb, so is this shrouded by that.\nYathā, as; vahnih, ﬁre, which is naturally bright; āvriyate, is enveloped;\ndhūmena,  by  smoke,  which  is  born  concomitantly  (with  ﬁre)  and  is\nnaturally dark; or as ādarśah, a mirror; is covered malena, by dirt; ca, and;\ngarbhah, a foetus; is āvrtah, enclosed; ulbena, in the womb by the amnion;\ntathā, so; is idam, this; āvrtam, shrouded; tena, by that.\nAgain, what is that which is indicated by the word idam (this),  and\nwhich is covered by desire? The answer is:\nआवृत ं \u0000ानमेतेन \u0000ािननो िन\u0000यवैिरणा।\nे ौ े े\nकाम\u0000पेण कौ\u0000तेय द\u0000ु पूरेणानलेन च॥ ३ ९ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "39": {
                    "original_verse": "O son of Kuntī, Knowledge is covered by this constant enemy of the\nwise in the form of desire, which is an insatiable ﬁre.\nJñānam, Knowledge; is āvrtam, covered; etena, by this; nityavairinā,\nconstant enemy; jñāninah, of the wise. For the wise person knows even\nearlier, ‘I  am  being  induced  by this  into  evil.’  And he  always (56) feels\ndistressed. Therefore, it is the constant enemy of the wise but not of a fool.\nFor the fool looks upon desire as a friend so long as hankering lasts. When\nsorrow  comes  as  a  consequence,  he  realizes,  ‘I  have  been  driven  into\nsorrow because of longings’, but certainly not earlier. Therefore it is the\nconstant enemy of the wise alone.\nIn  what  form? Kāma-rūpena,  in  the  form  of  desire—that  which  has\nwish itself as its expression is kāma-rūpa; in that form—; (and) duspūrena,\nwhich is an insatiable; analena, ﬁre. That which is difﬁcult to satisfy is\nduspūrah; and (derivatively) that which never has enough (alam) is analam.\nAgain, having what as its abode does desire, in the form of a veil over\nKnowledge, become the enemy of all? Since when the abode of an enemy is\nknown, it is possible to easily slay the enemy, therefore the Bhagavān says:\nइि\u0000\u0000यािण मनो बुि\u0000र\u0000यािध\u0000ानमु\u0000यते।\nएतैिव\u0000मोहय\u0000येष \u0000ानमावृ\u0000य देिहनम्॥ ४ ० ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "40": {
                    "original_verse": "The organs, mind, and the intellect are said to be its abode. This one\ndiversely deludes the embodied being by veiling Knowledge with the help\nof these.\nIndriyāni, the organs; manah, mind; and buddhih, the intellect; ucyate,\nare  said  to  be;  asya,  its,  desire’s;  adhisṭhānam,  abode.  Esāh,  this  one,\ndesire; vimohayati, diversely deludes; dehinam, the embodied being; āvrtya,\nby  veiling;  jñānam,  Knowledge;  etaih,  with  the  help  of  these,  with  the\norgans etc. which are its abodes. (57)\nत\u0000मा\u0000\u0000विमि\u0000\u0000या\u0000यादौ िनय\u0000य भरतष\u0000भ।\nपा\u0000मान ं \u0000जिह\u0000ेन ं \u0000ानिव\u0000ाननाशनम्॥ ४ १ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "41": {
                    "original_verse": "Therefore, O scion of the Bharata dynasty, after ﬁrst controlling the\norgans, renounce this one (58) which is sinful and a destroyer of learning and\nwisdom.\nSince  this  is  so,  therefore,  O  scion  of  the  Bharata  dynasty,  ādau\nniyamya, after ﬁrst controlling; indriyāni, the organs; prajahihi, renounce;\nenam, this one, the enemy under consideration; which is pāpmānam, sinful\n—which  is  desire  that  is  accustomed  to  sinning;  and  jñāna-vijñāna-\nnāśanam,  a  destroyer  of  learning  and  wisdom,  Jñāna,  learning,  means\nknowledge about the Self etc. from the scriptures and a teacher. Vijñāna,\nwisdom, means the full experience of that.\nRenounce, that is discard, from yourself the destroyer of those two—\nlearning  and  wisdom,  which  are  the  means  to  the  achievement  of\nLiberation.\nIt has been said, ‘After ﬁrst controlling the organs, renounce desire the\nenemy’.  As  to  that,  by  taking  the  support  of  what  should  one  give  up\ndesire? This is being answered:\nइि\u0000\u0000यािण परा\u0000याहिु रि\u0000\u0000ये\u0000य: पर ं मन:।\nमनस\u0000तु परा बुि\u0000य\u0000 बु\u0000े: परत\u0000तु स:॥ ४ २ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "wisdom"
                    ]
                },
                "42": {
                    "original_verse": "They say that the organs are superior (to the gross body); the mind is\nsuperior to the organs; but the intellect is superior to the mind. However, the\none who is superior to the intellect is He.\nThe learned ones āhuh, say; that indriyāni, the ﬁve (59) organs—ear etc.,\nare parāni, superior, to the external, gross and limited body, from the point\nof view of subtlety, inner position, pervasiveness, etc. So also, manah, the\nmind, having the nature of thinking and doubting; (60) is param, superior;\nindriyebhyah, to the organs. Similarly, buddhih, the  intellect,  having  the\nnature of determination; is parā, superior; manasah, to the mind. And yah,\nthe one who is innermost as compared with all the objects of perception\nending with the intellect, and with regard to which Dweller in the body it\nhas been said that desire, in association with its ‘abodes’ counting from the\norgans, deludes It by shrouding Knowledge; sah, that one; is tu, however;\nparatah, superior; buddheh, to the intellect—He, the supreme Self, is the\nwitness of the intellect. (61)\nे\nएव ं बु\u0000े: पर ं बु\u0000\u0000वा सं\u0000त\u0000या\u0000मानमा\u0000मना।\nजिह श\u0000ुं महाबाहो काम\u0000प ं दरु ासदम्॥ ४ ३ ॥",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "43": {
                    "original_verse": "(62) Understanding the Self thus (63) as superior to the intellect, and\ncompletely establishing (the Self) is spiritual absorption with the (help of)\nthe mind, O mighty-armed one, vanquish the enemy in the form of desire,\nwhich is difﬁcult to subdue.\nBuddhvā,  understanding;  ātmānam,  the  Self;  evam,  thus;  as  param,\nsuperior;  buddheh,  to  the  intellect;  and  saṁstabhya,  completely\nestablishing; ātmanā, with the mind, that is establishing (the Self) fully in\nspiritual absorption with the help of your own puriﬁed mind; O mighty-\narmed one, jahi, vanquish; this śatrum, enemy; kāma-rūpam, in the form of\ndesire; which is durāsadam, difﬁcult to subdue—which can be got hold of\nwith great difﬁculty, it being possessed of many inscrutable characteristics.\nFOOTNOTES AND REFERENCES\n[1] See Commentary on",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": []
                },
                "116": {
                    "original_verse": "Asṭekar’s reading is: Tat ca evam vidham karma kuto jātamityāha,\nAnd from where has this kind of action originated? The Bhagavān\nanswers this.’—Tr.\n[31] Here Asṭ. adds ‘revealer’—Tr.\n[32] Such as, that it pleases Bhagavān, secures the affection of the gods,\netc.\n[33] Duty with a view to securing Liberation.\n[34] Rati, trpti and santosa, though synonymous, are used to indicate\nvarious  types  of  pleasures.  Or, rati  means  attachment  to  objects;\ntrpti  means  happiness  arising  from  contact  with  some  particular\nobject; and santosa means happiness in general, arising from the\nacquisition of some coveted object only.\n[35] Ajānadbhih: This is also translated as, ‘surely because they were\nunenlightened’.—Tr.\n[36]  V.S.A  gives  the  meanings  of  the  phrase  as  ‘the  welfare  of  the\nworld’, and ‘propitiation of mankind’.—Tr.\n[37]  In  Asṭ.  this  introductory  sentence  is  as  follows:  loka-sangrahah\nkimartham kartavyam iti ucyate.—Tr.\n[38] This is according to the Asṭ. The Gī. Pr. reads, yat yat yesu yesu.—\nTr.\n[39] According to Ś. the translation of this portion is: There is nothing\nunattained that should be attained.—Tr.\n[40] Asṭ. and Ā.Ā. read varteya instead of varteyam.—Tr.\n[41] Asṭ. omits this sentence completely.—Tr.\n[42] Giving up the idea of agentship and the hankering for the rewards\nof actions to oneself.\n[43] Some translate yuktah as, ‘in the right manner’. S. takes it in the\nsense of Yog-yuktah, merged in Yog.—Tr.\n[44] Another reading is yojayet, meaning the same as josayet.—Tr.\n[45] Pradhāna, Māyā, the Power of Bhagavān.\n[46] Guna-vibhāga means the products of Prakrti which consists of the\nthree gunas. They are the ﬁve subtle elements, mind, intellect, ego,\nﬁve sensory organs, ﬁve motor organs and ﬁve objects (sound etc.)\nof the senses. Karma-vibhāga means the varieties of inter-actions\namong these.—Tr.\n[47] ‘Free from expectations of results for yourself’.\n[48] Here Asṭ. adds ‘parama, supreme’—Tr.\n[49] Finding fault where there is none.\n[50] Knowledge concerning the qualiﬁed and the unqualiﬁed Brahman.\n[51] Also, knowledge, desires, etc.\n[52] Ignorance, the cause of love and hatred, has discrimination as its\nopposite.\n[53] Customary or scripturally ordained observances of different castes\nand sects.—Tr.\n[54] L iberation stands for its cause, Illumination.\n[55] Gain and loss stand for future prosperity and adversity.\n[56] Both at the time when desire arises in him, and also when he is\nforced to act by it.\n[57] The activities of the organs etc. are the media for the expression of\ndesire.  Desire  covers  the  Knowledge  of  the  Self  by  stimulating\nthese.\n[58] A variant reading is, ‘prajahi hi-enam, completely renounce this\none’.—Tr.\n[59] Five sense-organs: of vision, hearing, taste, smell and touch; ﬁve\nmotor-organs: hands, feet, speech, and for excretion and generation\n—these latter ﬁve are also understood in the present context.\n[60] Sankalpa: will, volition, intention, thought, reﬂection, imagination,\netc. vikalpa: doubt, uncertainty, indecision, suspicion, error, etc.—\nV.S.A.\n[61] The portion, ‘with regard to which Dweller ... the supreme Self,’ is\ntranslated from Asṭ. which has the same reading here as the Ā.Ā.\nThe  Gī.  Pr.  makes  ‘the  “abode’’  counting  from  the  organs’  an\nadjective of ‘the Dweller in the body’, and omits the portion, ‘is tu,\nhowever ... buddheh, to the intellect’.—Tr.\n[62] The Ast, introduces this verse with, ‘Tatah kim, what follows from\nthat?’—Tr.\n[63] Understanding...thus:  that  desires  can  be  conquered  through  the\nknowledge of the Self.",
                    "speaker": "Krishna",
                    "commentary": {
                        "shankaracharya": ""
                    },
                    "tags": [
                        "action",
                        "wisdom"
                    ]
                }
            }
        }
    }
}